In [2]:
import pandas as pd
import numpy as np

### DataFrames are collection of data in rows and col format

In [3]:
df1=pd.DataFrame(np.arange(1,13,3))
df1

    0
0   1
1   4
2   7
3  10

In [4]:
l=[46,4,4,546,4,53,632,453,56,5,54]
df2=pd.DataFrame(l)
df2

      0
0    46
1     4
2     4
3   546
4     4
5    53
6   632
7   453
8    56
9     5
10   54

In [5]:
l2=[[1,2,3],[8,9,10]]
df3=pd.DataFrame(l2)
df3

   0  1   2
0  1  2   3
1  8  9  10

### DataFrame using Dictionary

In [6]:
#Keys Acts Like a column name
a=[{"Name":"Mohan","Age":3},{"Name":"Shyam","Age":20}]
df3=pd.DataFrame(a)
df3

    Name  Age
0  Mohan    3
1  Shyam   20

In [7]:
b={
    "Result":pd.Series(["Fail","Pass","Pass"]),
    "RollNo":pd.Series([1,23,28])
}
df4=pd.DataFrame(b)
df4

  Result  RollNo
0   Fail       1
1   Pass      23
2   Pass      28

### Reading Data From csv (Comma Separated Value)

In [13]:
df5=pd.read_csv(r"C:\Users\admin\Desktop\Salary_Data.csv")
df5.head()

   YearsExperience   Salary
0              1.1  39343.0
1              1.3  46205.0
2              1.5  37731.0
3              2.0  43525.0
4              2.2  39891.0

In [14]:
df5.tail(3)

    YearsExperience    Salary
27              9.6  112635.0
28             10.3  122391.0
29             10.5  121872.0